పుణ్యభూమి నాదేశం నమో నమామి..
ధన్యభూమి నాదేశం సదా స్మరామి. ॥పుణ్యభూమి॥

నన్ను కన్న నాదేశం నమో నమామి..
అన్నపూర్ణ నా దేశం సదా స్మరామి
మహామహుల కన్న తల్లి నా దేశం
మహోజ్వలిత చరిత కన్న భాగ్యోదయ దేశం ....నా దేశం..... ॥పుణ్యభూమి॥

అదిగో ఛత్రపతి.. ద్వజమెత్తిన ప్రజాపతి
మతోన్మాద శక్తులు చురకత్తులు ఝలిపిస్తే
మానవతుల మాంగళ్యం మంట గలుపుతుంటే
ఆ క్షుద్ర రాజకీయానికి రుద్ర నేత్రుడై లేచి
మాతృభూమి నుదిటి పై నెత్తుటి తిలకం దిద్దిన మహావీరుడు... సార్వ భౌముడు...
అడుగో అరి భయంకరుడు కట్ట బ్రహ్మన
అది వీర పాండ్య వంశాంకుర సింహ గర్జన ॥అడుగో॥
ఒరేయ్‌ ఎందుకు కట్టాలిరా శిస్తు,
నారు పోసావా.... నీరు పెట్టావా ....
కోత కోసావా .... కుప్పనూర్చావా....
